* TODO m with

- machine, m
- types, (pm vm xm)
- aka compute
- m on, aka hypervisor
  - [ ] such as vmware's, kvm/qemu and so on?
    - vmware's becoming complicated with and so called vxrail
    - kvm's openstack, say
- m without any, pure, pm but it have to be born/made

* m

#+BEGIN_SRC emacs-lisp
  '(m
    (pm
     vm
     xm))
#+END_SRC

#+RESULTS:
| m | (pm vm xm) |

* m, not only machine

* pm

- bare metal, white box, server, pc?
- and to me, box

* vm

- xen, virtualbox, kvm
- with openstack
- on mac called hyperkit then

* xm

- solaris containers, docker, lxc(linux container), chroot
- with k8s, openshift
- docker
- [2021-11-06 Sat] 걸린다 걸린다 플랫폼에 걸린다 아래쪽에 걸린다 pm에 걸린다 또 vm에 걸린다 바로 아래다
  - mac > multipass(hyperkit maybe) > ubuntu > docker > ceos
    #+BEGIN_SRC 
        - OCI runtime exec failed: exec failed: container_linux.go:380: starting container process caused: exec: "Cli": executable file not found in $PATH: unknown
    #+END_SRC

